/*무한 반복문내에서 for문을 사용해서 계산하고자 하는 숫자의 n제곱d을 구하는 프로그램을 작성하시오
단, 계산하도자 하는 숫자와, n제곱은 사요자 입력을 받으며 입력받는 수는 양의 정수로만 사용하시오. 
만약 입력된 값이 음수나 0이 들어오면 입력 받도록 하시오.*/

//#include <stdio.h>
//#include <math.h>
//
//int main(void)
//{
//	int x, n, i;
//	while (1)
//	{
//		printf("구하고자 하는 제곱근의 밀수와 지수입력");
//		scanf_s("%d%d", &x, &n);
//
//		if (n <= 0 || x <= 0)
//			continue;
//		for (i = 1; i <= n; i++)
//		{
//			printf("%d의 %d제곱=%.0lf\n", x, i, pow(x, i));
//		}
//	}
//}
//-----------------------------------------------------------------
// 별 거꾸로 만들기5->1
//#include<stdio.h>
//int main(void)
//{
//	int x, y;
//	for (x = 0; x <= 5; x++)
//	{
//		for (y = 5; y > x; y--)
//			printf("*");
//		printf("\n");
//
//	}
//	return 0;
//}
//------------------------------------------------------
/*0부터 5까지 5번씩 나열하는 결과 값*/
//#include <stdio.h>
//int main(void)
//{
//	int i, j;
//	for (i = 0; i < 6; i++)
//	{
//		for(j=0;j<6;j++)
//			printf("%d",i)
//			printf("")
//	}
//}
//-----<<<<<<<<<<<이거 코드 다시 작성
//test 7
/*별로 모래시계 만들기*/
//#include <stdio.h>
//int main(void)
//{
//	int a, b;
//	for(a=5;a>0;a--)
//}
//---->>>>>>>>>>이거 코드 다시 작성
/*test
 마름모의 높이를 입력하여 그림과 같은 출력이 나타나도록 하시오.
 단 홀수가 입력되도록 하시오*/
//#include<stdio.h>
//int main(void)
//{
//	int a, b;
//	for(a=0;a>5;a++)
//
//---------------->>코드 다시 작성

