/* 사용자로부터 16진 정수를 입력받아 8진수, 10진수, 16진수로 출력하는 프로그램을 작성하시오.*/

//#include <stdio.h>
//int main(void)
//{
//	int a;
//	a = 256;
//
//	printf("16진 정수를 입력하시오: ");
//	scanf_s("%lf", &a);
//
//	printf("8진수 = %o\n", a);
//	printf("10진수 = %d\n", a);
//	printf("16진수 = %x\n", a);
//
//}
//----------------------------------------------------------------------------
 /*int형의 변수 x와 y의 값을 서로 교환하는 프로그램을 작성하여 보시오.
 별도의 변수가 필요하면 정의하여 사용하시오.
 X=10, y=20으로 초기화하여 사용하시오*/

//#include <stdio.h>
//int main(void)
//{
//	int x, y;
//	int tmp;
//
//	x = 10;
//	y = 20;
//
//	printf("x=%d y=%d\n", x, y);
//
//	tmp = x;
//	x = y;
//	y = tmp;
//
//	printf("x=%d y=%d\n", x, y);
//
//	return 0;
//}
//------------------------------------------------------------------
/*우리나라에서 많이 사용되는 면적의 단위인 평을 제곱미터로 환산하는 프로그램을 작성하시오
1평은 3.3m^2이다. 사용자로 부터 평을 입력받아 제곱미터로 환산할 때 변수들의 자료형은 결과값에 맞추어
선택하여 선언하고, 기호상수  const를 이용하여 1 평당 제곱미터값을 선언하시오.*/

//#include <stdio.h>
//int main(void)
//{
//	const double METER_PER_PYEONG = 3.3;
//	double pyeong, m;
//
//	printf(" 평을 입력하시오.: ");
//	scanf_s("%lf", &pyeong);
//	m = pyeong * METER_PER_PYEONG;
//	printf("%.1lf평은 %.1lf평방미터입니다. \n", pyeong, m);
//
//
//
//	return 0;
//}
////------------------------------------------------------------------------------

///*사용자가 10진 정수의 아스키 코드값을 입력하면 아스키 코드값에 해당하는 문자를 출력하는
//프로그램을 작성하시오
//입력하는 10진 정수는 33~126까지만 사용하시오.*/
//#include <stdio.h>
//
//int main(void)
//{
//	int code;
//	printf("10진 정수의 아스키 코드값을 입력하시오: ");
//	scanf_s("%d", &code);
//	printf("문자:%c입니다.\n", code);
//
//
//	return 0;
//
//}
//------------------------------------------------------------------------------
